// Խնդիր 20 Հակադիր թվեր.cpp

/* Գրել ծրագիր, որը մուտքում կստանա A, B, C և D ամբողջ թվերը։ Պահանջվում է արտածել YES եթե A-ն հակադիր է D֊ին և B֊ն հակադիր չէ C ֊ին, NO հակառակ դեպքում։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    1 2 3 -1

    Ելք
    YES

    ====== Թեստ #2 =======
    Մուտք
    1 2 -2 -1

    Ելք
    NO
    === Թեստ #3 =======
    Մուտք
    -145 785 785 145

    Ելք
    YES

    ====== Թեստ #4 =======
    Մուտք
    -500 500 500 -500

    Ելք
    NO

    ====== Թեստ #5 =======
    Մուտք
    789 -789 789 -789

    Ելք
    NO

    ====== Թեստ #6 =======
    Մուտք
    951 753 -753 -951

    Ելք
    NO

    ====== Թեստ #7 =======
    Մուտք
    0 0 0 0

    Ելք
    NO
*/

#include <iostream>

int main()
{
    int a, b, c, d;
    std::cin >> a >> b >> c >> d;
    if (d + a == 0)
    {
        if (b + c != 0)
        {
            std::cout << "YES";
        }
        else
        {
            std::cout << "NO";
        }
    }
    else
    {
        std::cout << "NO";
    }
}
