// Խնդիր 11 Հավասարություն.cpp

/* Գրել ծրագիր, որը մուտքում կստանա 2 դրական ամբողջ թիվ և կարտածի YES, եթե այդ թվերը հավասար են և NO հակառակ դեպքում։ */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	1 1

	Ելք
	YES

	====== Թեստ #2 =======
	Մուտք
	4 5

	Ելք
	NO

	====== Թեստ #3 =======
	Մուտք
	0 789526

	Ելք
	NO

	====== Թեստ #4 =======
	Մուտք
	159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874159874 159874

	Ելք
	NO

	====== Թեստ #5 =======
	Մուտք
	4294967295 4294967295

	Ելք
	YES
*/

#include <iostream>

int main()
{

	unsigned int a, b;
	std::cin >> a >> b;

	if (a == b)
	{
		std::cout << "YES";
	}
	else
	{
		std::cout << "NO";
	}
}
