// 0.1(work)HomeWork.cpp

/* Напишите программу, которая будет печатать «Hello world!». Каждый символ в выражении в новой строке. */

/*
	Примеры
	====== Тест #1 =======
	Входные данные

	Результат работы
	H
	e
	l
	l
	o

	w
	o
	r
	l
	d
	!
*/

#include <iostream>
int main()
{
	std::cout << "H\n";
	std::cout << "e\n";
	std::cout << "l\n";
	std::cout << "l\n";
	std::cout << "o\n";
	std::cout << "\n";
	std::cout << "w\n";
	std::cout << "o\n";
	std::cout << "r\n";
	std::cout << "l\n";
	std::cout << "d\n";
	std::cout << "!\n";
}