// Խնդիր 06 Զույգ տարրերի քանակ.cpp

/* Գրել ծրագիր, որը մուտքում կստանա N բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Անհրաժեշտ է, որ ծրագիրը արտածի հաջորդականության զույգ տարրերի քանակը։ Խնդիրը լուծելիս օգտագործել դինամիկ զանգված։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    1 5

    Ելք
    0
    ====== Թեստ #2 =======
    Մուտք
    5 2 4 6 8 10

    Ելք
    5
    ====== Թեստ #3 =======
    Մուտք
    100 1 1 1 1 1 1 1 1 1 1  1 1 1 1 1 1 1 1 1 1  1 1 1 1 1 1 1 1 1 1  1 1 1 1 1 1 1 1 1 1  1 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2

    Ելք
    50
    ====== Թեստ #4 =======
    Մուտք
    5 -1 -2 -3 -4 -5

    Ելք
    2
*/

#include <iostream>

int main()
{
    unsigned size;
    std::cin >> size;
    int *dynArr = new int[size];
    int counnt = 0;
    for (int i = 0; i < size; i++)
        std::cin >> dynArr[i];
    for (int i = 0; i < size; i++)
    {
        if (dynArr[i] % 2 == 0)
            ++counnt;
    }
    std::cout << counnt;
}