// Խնդիր 24 Ռեկուրենտ հաջորդականություն.cpp

/* Տրված է Kn ռեկուրենտ հաջորդականություն, որի Ki տարրը որշվում է հետևյալ կանոններով․
  . Ki = i, եթե i ≤ 3
  . Ki = 2 * Ki + 3, եթե i - ն կենտ է և i > 3
  . Ki = 3 + Ki / 2, եթե i - ն զույգ է և i > 3
Գրել ծրագիր որը մուտքում կստանա i(i ≤ 1000000000) բնական թիվը և կարտածի հաջորդականության i֊րդ տարրը :
*/

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    1

    Ելք
    1
    ====== Թեստ #2 =======
    Մուտք
    2

    Ելք
    2
    ====== Թեստ #3 =======
    Մուտք
    3

    Ելք
    3
    ====== Թեստ #4 =======
    Մուտք
    4

    Ելք
    5
    ====== Թեստ #5 =======
    Մուտք
    5

    Ելք
    16
    ====== Թեստ #6 =======
    Մուտք
    6

    Ելք
    6
    ====== Թեստ #7 =======
    Մուտք
    7

    Ելք
    38
    ====== Թեստ #8 =======
    Մուտք
    8

    Ելք
    8
    ====== Թեստ #9 =======
    Մուտք
    9

    Ելք
    18
    ====== Թեստ #10 =======
    Մուտք
    1000000000

    Ելք
    11173
    ====== Թեստ #11 =======
    Մուտք
    999999999

    Ելք
    272142
    ====== Թեստ #12 =======
    Մուտք
    805306365

    Ելք
    174
    ====== Թեստ #13 =======
    Մուտք
    358590891

    Ելք
    43266
    ====== Թեստ #14 =======
    Մուտք
    146406684

    Ելք
    71400
    ====== Թեստ #15 =======
    Մուտք
    762299094

    Ելք
    723549
    ====== Թեստ #16 =======
    Մուտք
    462648445

    Ելք
    16010
    ====== Թեստ #17 =======
    Մուտք
    227918266

    Ելք
    19445
    ====== Թեստ #18 =======
    Մուտք
    995168599

    Ելք
    365534
    ====== Թեստ #19 =======
    Մուտք
    623271450

    Ելք
    129555
    ====== Թեստ #20 =======
    Մուտք
    319571912

    Ելք
    72785
*/

#include <iostream>
using namespace std;

unsigned long long sequence(int i)
{
    if (i <= 3)
        return i;
    if (i % 2 == 1)
        return 2 * sequence(i + 3);
    if (i % 2 == 0)
        return 3 + sequence(i / 2);
}
int main()
{
    unsigned long long i;
    cin >> i;
    cout << sequence(i);
}