// Խնդիր 20 Insertion sort.cpp

/* Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Անհրաժեշտ է, որ ծրագիրը արտածի հաջորդականության տարրերը դասավորված նվազման կարգով։ Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ Խնդիրը լուծելիս օգտագործել զանգված և insertion sort ալգորիթմ։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    10 1 2 3 4 5 6 7 8 9 10

    Ելք
    10 9 8 7 6 5 4 3 2 1
    ====== Թեստ #2 =======
    Մուտք
    5 -1 8 -15 99 -100

    Ելք
    99 8 -1 -15 -100
*/

#include <iostream>

int main()
{
    int N;
    int arr[1000]{};
    std::cin >> N;
    for (int i = 0; i < N; ++i)
    {
        std::cin >> arr[i];
    }
    for (int j = 1; j < N; ++j)
    {
        int k = j;
        while (k - 1 >= 0 && arr[k - 1] < arr[k])
        {
            int temp = arr[k - 1];
            arr[k - 1] = arr[k];
            arr[k] = temp;
            --k;
        }
    }
    for (int t = 0; t < N; ++t)
    {
        std::cout << arr[t] << " ";
    }
}