// Խնդիր 17 Պատկանում է միջակայքին.cpp

/* Պահանջվում է գրել ծրագիր, որը մուտքում կստանա A, B, C սահող կետով թվերը։ Որպես արդյունք ծրագիրը պետք է արտածի YES, եթե A-ն [B, C) միջակայքից է և NO հակառակ դեպքում։ Հայտնի է, որ B֊ն փոքր է քան C֊ն։ */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	4 5 6

	Ելք
	NO

	====== Թեստ #2 =======
	Մուտք
	10 5 15

	Ելք
	YES

	====== Թեստ #3 =======
	Մուտք
	15 5 15

	Ելք
	NO

	====== Թեստ #4 =======
	Մուտք
	15.66 15.65 15.67

	Ելք
	YES

	====== Թեստ #5 =======
	Մուտք
	-1.125 -1.125 -1.1

	Ելք
	YES

	====== Թեստ #6 =======
	Մուտք
	145.145 10.145 145.145

	Ելք
	NO
*/

#include <iostream>

int main()
{
	double a, b, c;
	std::cin >> a >> b >> c;
	if (a >= b && a < c)
	{
		std::cout << "YES";
	}
	else
	{
		std::cout << "NO";
	}
}
