// Խնդիր 17  Երկուական ներկայացում.cpp

/* Գրել ծրագիր, որը մուտքում կստանա դրական ամբողջ թիվ և կարտածի այդ թվի երկուական ներկայացումը։ Տասականից երկուականի անցումը իրականացնել ֆունկցիայի միջոցով։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    5

    Ելք
    101
    ====== Թեստ #2 =======
    Մուտք
    100

    Ելք
    1100100
    ====== Թեստ #3 =======
    Մուտք
    0

    Ելք
    0
    ====== Թեստ #4 =======
    Մուտք
    65536

    Ելք
    10000000000000000
    ====== Թեստ #5 =======
    Մուտք
    1

    Ելք
    1
    ====== Թեստ #6 =======
    Մուտք
    87381

    Ելք
    10101010101010101
*/

#include <iostream>
#include <string>

std::string toBinary(int &n)
{
    std::string bin;
    if (n == 0)
        bin = '0';
    while (n != 0)
    {
        bin = (n % 2 == 0 ? "0" : "1") + bin;
        n /= 2;
    }
    return bin;
}
int main()
{
    int n;
    std::cin >> n;
    std::cout << toBinary(n);
}