// Խնդիր 07 Կրկնվող տարրեր.cpp

/* Գրել ծրագիր, որը մուտքում կստանա N բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Պահանջվում է արտածել հաջորդականության բոլոր այն տարրերը որոնք կրկնվում են։ Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ Խնդիրը լուծելիս օգտագործել դինամիկ զանգված։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    5 1 2 3 4 5

    Ելք

    ====== Թեստ #2 =======
    Մուտք
    4
    1 2 2 1

    Ելք
    1 2
    ====== Թեստ #3 =======
    Մուտք
    10 1 1 2 2 3 3 4 4 5 5

    Ելք
    1 2 3 4 5
    ====== Թեստ #4 =======
    Մուտք
    6 1 1 2 1 2 2

    Ելք
    1 2
    ====== Թեստ #5 =======
    Մուտք
    4 1 1 1 1

    Ելք
    1
*/

#include <iostream>
#include <vector>

int main()
{
    int N;
    std::cin >> N;
    std::vector<int> dynArr(N);
    int count = 0;
    for (int i = 0; i < dynArr.size(); ++i)
        std::cin >> dynArr[i];
    for (int i = 0; i < dynArr.size(); i++)
    {
        for (int j = i + 1; j < dynArr.size(); j++)
        {
            if (dynArr[i] == dynArr[j])
            {
                for (int n = j - 1; n >= 0; n--)
                {
                    if (dynArr[j] == dynArr[n])
                        count++;
                }
                if (count == 1)
                {
                    std::cout << dynArr[i] << " ";
                }
                count = 0;
            }
        }
    }
}