// Խնդիր 12 Երկուսից մեծը.cpp

/* Գրել ծրագիր, որը մուտքում կստանա 2 դրական ամբողջ թիվ և կարտածի այդ թվերց մեծը։ */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	1 5

	Ելք
	5

	====== Թեստ #2 =======
	Մուտք
	2 2

	Ելք
	2

	====== Թեստ #3 =======
	Մուտք
	0 789526

	Ելք
	789526

	====== Թեստ #4 =======
	Մուտք
	159874 4294967295

	Ելք
	4294967295

	====== Թեստ #5 =======
	Մուտք
	4294967295 4294967295

	Ելք
	4294967295
*/

#include <iostream>

int main()
{
	unsigned int a, b;
	std::cin >> a >> b;
	if (a > b)
	{
		std::cout << a;
	}
	else
	{
		std::cout << b;
	}
}
