// Խնդիր 02  Միջակայքի զույգ թվեր.cpp

/* Գրել ծրագիր, որը մուտքում կստանա A և B ամբողջ թվերը և կարտածի [A, B] միջակայքի բոլոր զույգ թվերը։ Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	4 4

	Ելք
	4
	====== Թեստ #2 =======
	Մուտք
	1 5

	Ելք
	2 4
	====== Թեստ #3 =======
	Մուտք
	-7 -6

	Ելք
	-6
*/

#include <iostream>

int main()
{
	int a, b;
	std::cin >> a >> b;

	while (b >= a)
	{
		if (a % 2 == 0)
		{
			std::cout << a << " ";
		}
		a += 1;
	}
}
