// Խնդիր 07 Տարբերություն.cpp

/* Գրել ծրագիր, որը մուտքում ստանում է N բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Որպես արդյունք ծրագիրը պետք է արտածի հաջորականության մեծագույն և փոքրագույն տարրերի տարբերութունը։ Խնդիրը լուծել առանց զանգված օգտագործելու։ */

/*
	Օրինակներ
	====== Թեստ #1 ====== =
	Մուտք
	1 5

	Ելք
	0
	====== Թեստ #2 =======
	Մուտք
	10 1 2 3 4 5 6 7 8 9 10

	Ելք
	9
	====== Թեստ #3 =======
	Մուտք
	10 10 9 8 7 6 5 4 3 2 1

	Ելք
	9
	===== Թեստ #4 =======
	Մուտք
	10 -1 -2 -3 -4 -5 5 4 3 2 1

	Ելք
	10
*/

#include <iostream>
#include <limits>

int main()
{
	int N, max, min;
	max = std::numeric_limits<int>::min();
	min = std::numeric_limits<int>::max();
	std::cin >> N;
	for (int i = 0; i < N; ++i)
	{
		int x;
		std::cin >> x;

		if (x > max)
		{
			max = x;
		}
		if (x < min)
		{
			min = x;
		}
	}
	std::cout << max - min << "\n";
}
