// Խնդիր 11 Վերջինից տարբեր.cpp

/* Գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Որպես արդյունք ծրագիրը պետք է արտածի հաջորդականությունում վերջին տարրից տարբեր տարրերի քանակը։ Խնդիրը լուծելիս օգտագործել զանգված։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    4 1 2 3 4

    Ելք
    3
    ====== Թեստ #2 =======
    Մուտք
    4 1 1 1 1

    Ելք
    0
    ====== Թեստ #3 =======
    Մուտք
    0

    Ելք
    0
    ====== Թեստ #4 =======
    Մուտք
    1 44

    Ելք
    0
*/

#include <iostream>

int main()
{
    int N;
    int count = 0;
    std::cin >> N;
    int arr[1000]{};
    for (int i = 0; i < N; ++i)
    {
        std::cin >> arr[i];
    }
    for (int j = 0; j < N; ++j)
    {
        if (arr[N - 1] != arr[j])
        {
            ++count;
        }
    }
    std::cout << count;
}
