// Խնդիր 03 Մնացորդ.cpp

/* Գրել ծրագիր, որը մուտքում կստանա A և B դրական ամբողջ թվերը և կարտածի A֊ն B֊ի բաժանման արդյունքում ստացված 
մնացորդը։ Հայտնի է, որ B֊ն 0 չէ։ */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	7 5

	Ելք
	2
	
	====== Թեստ #2 =======
	Մուտք
	3 6

	Ելք
	3
	
	====== Թեստ #3 =======
	Մուտք
	20 10

	Ելք
	0
	
	====== Թեստ #4 =======
	Մուտք
	0 5

	Ելք
	0
	
	====== Թեստ #5 =======
	Մուտք
	2720047104 7896526

	Ելք
	3642160
	
	====== Թեստ #6 =======
	Մուտք
	10001000 1001

	Ելք
	9
*/

#include <iostream>

int main()
{
	long long a, b;
	std::cin >> a >> b;
	std::cout << a % b;
}