// Խնդիր 22  Ամենամեծ ընդհանուր բաժանարար.cpp

/* Գրել ծրագիր, որը մուտքում կստանա երկու բնական թվեր և կարտածի դրանց ամենամեծ ընդհանուր բաժանարարը: Անհրաժեշտ է խնդիրը լուծել ռեկուրսիվ ֆունկցիայի միջոցով։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    5 3

    Ելք
    1

    ====== Թեստ #2 =======
    Մուտք
    157 8923

    Ելք
    1

    ====== Թեստ #3 =======
    Մուտք
    26 39

    Ելք
    13

    ====== Թեստ #4 =======
    Մուտք
    64 127

    Ելք
    1

    ====== Թեստ #5 =======
    Մուտք
    999999 9999

    Ելք
    99

    ====== Թեստ #6 =======
    Մուտք
    1234 24680

    Ելք
    1234

    ====== Թեստ #7 =======
    Մուտք
    1000000000 9990

    Ելք
    10

    ====== Թեստ #8 =======
    Մուտք
    12121212 81818181

    Ելք
    3030303

    ====== Թեստ #9 =======
    Մուտք
    981678 134618976

    Ելք
    6

    ====== Թեստ #10 =======
    Մուտք
    347893773 734897894

    Ելք
    1

    ====== Թեստ #11 =======
    Մուտք
    1000000000 1000000000

    Ելք
    1000000000

    ====== Թեստ #12 =======
    Մուտք
    999999999 444444444

    Ելք
    111111111
    
    ====== Թեստ #13 =======
    Մուտք
    132 144

    Ելք
    12

    ====== Թեստ #14 =======
    Մուտք
    31225 625

    Ելք
    25

    ====== Թեստ #15 =======
    Մուտք
    1024 65536

    Ելք
    1024
*/

// Տարբերակ 1
#include <iostream>
using namespace std;

int nod(int a, int b)
{
    if (a == b)
        return a;

    if (a > b)
    {
        int tmp = a;
        a = b;
        b = tmp;
    }
    return nod(a, b - a);
}

int main()
{
    int a, b;
    cin >> a >> b;
    cout << nod(a, b) << endl;
}

/*
// Տարբերակ 2
#include <iostream>
using namespace std;

int nod(int a, int b)
{
    if (max(a, b) % min(a, b) == 0)
        return min(a, b);
    nod(max(a, b) % min(a, b), min(a, b));
}

int main()
{
    int a, b;
    cin >> a >> b;
    cout << nod(a, b) << endl;
}
*/