// Խնդիր 08  Սահող կետով և ամբողջ թվեր (2)․cpp

/* Պահանջվում է գրել ծրագիր, որը մուտքում կստանա A և B ամբողջ թվերը, ապա C և D սահող կետով թվերը։ Որպես արդյունք ծրագիրը պետք է արտածի A * C - B / D արտահայտության արժեքը։ Հայտնի է, որ D֊ն 0 չէ։ */

/*
	Примеры
	====== Թեստ #1 =======
	Մուտք
	3 10 0.111111 3

	Ելք
	-3

	====== Թեստ #2 =======
	Մուտք
	3 10 0.111111 -3

	Ելք
	3.66667
	
	====== Թեստ #3 =======
	Մուտք
	15 10 5 3

	Ելք
	71.6667
	
	====== Թեստ #4 =======
	Մուտք
	15 10 3 -3

	Ելք
	48.3333
	
	====== Թեստ #5 =======
	Մուտք
	-3 -10 0.111111 0.111111

	Ելք
	89.6668
*/

#include <iostream>

int main()
{
	int A, B;
	double C, D;
	std::cin >> A >> B >> C >> D;
	std::cout << A * C - B / D;
}