// Խնդիր 08 Ամենաերկար ենթահաջորդականություն.cpp

/* Գրել ծրագիր, որը մուտքում կստանա N բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Պահանջվում է արտածել հաջորդականության ամենաերկար խիստ աճող անընդհատ ենթահաջորդականության տարրերի քանակը։. */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    1 -10

    Ելք
    1
    ====== Թեստ #2 =======
    Մուտք
    2 123 123

    Ելք
    1
    ====== Թեստ #3 =======
    Մուտք
    2 -1245 234

    Ելք
    2
    ====== Թեստ #4 =======
    Մուտք
    5 1 2 3 -1 -20

    Ելք
    3
    ====== Թեստ #5 =======
    Մուտք
    5 1 1 2 3 1

    Ելք
    3
    ====== Թեստ #6 =======
    Մուտք
    5 0 0 0 1 10000

    Ելք
    3
    ====== Թեստ #7 =======
    Մուտք
    10 1 2 3 1 2 3 3 4 5 6

    Ելք
    4
    ====== Թեստ #8 =======
    Մուտք
    20 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -2147483648

    Ելք
    1
*/

#include <iostream>
#include <vector>

int main()
{
    int n;
    std::cin >> n;
    std::vector<int> v(n);
    for (int i = 0; i < v.size(); ++i)
        std::cin >> v[i];
    int count = 1, l;
    for (int i = 1; i < v.size(); i++)
    {
        l = 1;
        while (i < v.size() && v[i] > v[i - 1])
        {
            i++;
            l++;
        }
        if (l > count)
            count = l;
    }
    std::cout << count;
}