// Խնդիր 13  Նախ բացասականները.cpp

/* Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Անհրաժեշտ է, որ ծրագիրը նախ արտածի հաջորդականության բացասական տարրերը ապա ոչ բացասականները։ Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ Խնդիրը լուծելիս օգտագործել զանգված։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    4 0 -2 6 -8

    Ելք
    -2 -8 0 6
    ====== Թեստ #2 =======
    Մուտք
    10 1 2 3 4 5 6 7 8 9 10

    Ելք
    1 2 3 4 5 6 7 8 9 10
    ====== Թեստ #3 =======
    Մուտք
    3 -1 -2 -3

    Ելք
    -1 -2 -3
    ====== Թեստ #4 =======
    Մուտք
    0

    Ելք
*/

#include <iostream>

int main()
{
    int n;
    std::cin >> n;
    int tmp;
    int arr[1000]{};
    for (int i = 0; i < n; i++)
    {
        std::cin >> arr[i];
    }
    for (int i = 0; i < n; i++)
    {
        if (arr[i] < 0)
        {
            for (int j = 0; j < i; j++)
            {
                if (arr[j] >= 0)
                {
                    tmp = arr[i];
                    arr[i] = arr[j];
                    arr[j] = tmp;
                }
            }
        }
    }
    for (int i = 0; i < n; i++)
    {
        std::cout << arr[i] << " ";
    }
}