// Խնդիր 23  Չեբիշևի բազմանդամ.cpp

/* Գրել ծրագիր որը մուտքում տրված n ≥ 0 ամբողջ և x իրական թվերի համար գտնում է Չեբիշևի բազմանդամի n-րդ գործակիցը։ Չեբիշևի Tn(x) բազմանդամը սահմանվում է հետևյալ ձևով:  */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    0 1.2

    Ելք
    1.000000

    ====== Թեստ #2 =======
    Մուտք
    1 5.7

    Ելք
    5.700000

    ====== Թեստ #3 =======
    Մուտք
    2 3.1

    Ելք
    18.220000

    ====== Թեստ #4 =======
    Մուտք
    0 88.9994

    Ելք
    1.000000

    ====== Թեստ #5 =======
    Մուտք
    1 -5.46

    Ելք
    -5.460000

    ====== Թեստ #6 =======
    Մուտք
    5 45.963

    Ելք
    3280233853.132830
    
    ====== Թեստ #7 =======
    Մուտք
    9 -2.33

    Ելք
    -331564.249256
*/

#include <iostream>
using namespace std;

double chebeshev(double n, double x)
{
    if (n == 0)
        return 1;
    else if (n == 1)
        return x;
    else
        return 2 * x * chebeshev(n - 1, x) - chebeshev(n - 2, x);
}
int main()
{
    double n, x;
    cin >> n;
    cin >> x;
    cout << fixed << chebeshev(n, x) << endl;
}