// Խնդիր 21 Ֆակտորիալ և ֆիբոնաչի.cpp

/* Գրել ծրագիր, որը մուտքում կստանա n (1 ≤ n ≤ 10) և կարտածի մուտքային թվի ֆակտորիալի և ֆիբոնաչիի հաջորդականության n֊րդ տարրի հարաբերությունը 5 նիշի ճշտությամբ։: Անհրաժեշտ է, որ թվի ֆակտորիալ հաշվելու և ֆիբոնաչիի հաջորդականության n֊րդ տարրի հաշվարկի ֆունկցիաները լինեն ռեկուրսիվ: */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    5

    Ելք
    24.000000
    ====== Թեստ #2 =======
    Մուտք
    1

    Ելք
    1.000000
    ====== Թեստ #3 =======
    Մուտք
    9

    Ելք
    10672.941176
    ====== Թեստ #4 =======
    Մուտք
    7

    Ելք
    387.692308
    ====== Թեստ #5 =======
    Մուտք
    10

    Ելք
    65978.181818
*/

#include <iostream>
using namespace std;

unsigned factorial(unsigned n)
{
    if (n <= 1)
        return 1;
    else
        return n * factorial(n - 1);
}

double fib(double n)
{
    if (n == 0)
        return 0;

    if (n == 1)
        return 1;
    else
        return (fib(n - 1) + fib(n - 2));
}

int main()
{
    double n;
    cin >> n;
    cout << fixed << factorial(n) / fib(n);
}