// Խնդիր 15 Հայելային գումար.cpp

/* Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է n (n ≤ 1000) բնական թիվ, ապա a0, a1, a2, ... an-1 ամբողջ թվերի հաջորդականությունը և կարտածի b0, b1, b2, ... b(n-1)/2։ Որտեղ bi = ai + an - i - 1։ Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ Խնդիրը լուծելիս օգտագործել զանգված։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    9 1 2 3 4 5 6 7 8 9

    Ելք
    10 10 10 10
    ====== Թեստ #2 =======
    Մուտք
    6 1 5 10 15 -20 30

    Ելք
    31 -15 25
*/

#include <iostream>

int main()
{
    int n;
    int arr[1000]{};
    int b[1000]{};
    std::cin >> n;
    for (int i = 0; i < n; i++)
    {
        std::cin >> arr[i];
    }
    for (int j = 0; j < n / 2; j++)
    {
        b[j] = arr[j] + arr[n - j - 1];
        std::cout << b[j] << " ";
    }
}