// Խնդիր 02 Ողղանկյան մակերես.cpp

/* Գրել ծրագիր, որը մուտքում կստանա ուղղանկյան 2 կողմերի երկարությունը և կարտածի այդ ուղղանկյան մակերեսը։ */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	1 1

	Ելք
	1

	====== Թեստ #2 =======
	Մուտք
	2 4

	Ելք
	8

	====== Թեստ #3 =======
	Մուտք
	10 1010

	Ելք
	10100

	====== Թեստ #4 =======
	Մուտք
	123 123

	Ելք
	15129

	====== Թեստ #5 =======
	Մուտք
	15987 7532

	Ելք
	120414084

	====== Թեստ #6 =======
	Մուտք
	2147483647 2

	Ելք
	4294967294

	====== Թեստ #7 =======
	Մուտք
	680011776 4

	Ելք
	2720047104
*/

#include <iostream>

int main()
{
	long long length, width;
	std::cin >> length >> width;
	std::cout << length * width;
}
