// Խնդիր 18 Արտահայտության արժեք.cpp

/* Գրել ֆունկցիա, որը որպես արգումենտ կստանա n բնական թիվը և կվերադարձնի n!/(n+1) արտահայտության արժեքը։ Ապա հաշվել հետևյալ արտահայտության արժեքը 1!/2 + 2!/3 + 3!/4 + 4!/5 + 5!/6 + 6!/7 + 7!/8 + 8!/9 + 9!/10 + 10!/11: Պատասխանը արտածել 5 նշի ճշտությամբ։  */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք

    Ելք
    371419.232900
*/

#include <iostream>

double expression_value(int n)
{
    double num = 0;
    double f = 1;
    double i = 2;
    double sum = 0;
    while (num <= n - 1)
    {
        f = f + f * num;
        num++;
        sum += f / i;
        ++i;
    }
    std::cout << std::fixed << sum;
}

int main()
{
    int n = 10;
    expression_value(n);
}