// Խնդիր 03  Միջակայքի 7֊ի բազմապատիկներ.cpp

/* Պահանջվում է գրել ծրագիր, որը մուտքում կստանա A և B ամբողջ թվերը և կարտածի [A, B] միջակայքի բոլոր այն թվերի քանակը, որոնք առանց մնացորդի բաժանվում են 7֊ի: */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	7 13

	Ելք
	1
	====== Թեստ #2 =======
	Մուտք
	5 21

	Ելք
	3
	==== Թեստ #3 =======
	Մուտք
	-8 -5

	Ելք
	1
	====== Թեստ #4 =======
	Մուտք
	-100000 100000

	Ելք
	28571
*/

#include <iostream>

int main()
{
	int a, b, quantity;
	quantity = 0;
	std::cin >> a >> b;

	while (b >= a)
	{
		if (a % 7 == 0)
		{
			quantity += 1;
		}
		a += 1;
	}
	std::cout << quantity;
}
