// Խնդիր 17  Չի կրկնվում միայն.cpp

/* Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 100) բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Հայտնի է, որ հաջորդականության բոլոր տարրերը հանդիպում են ճիշտ երկու անգամ բացառությամբ մեկի։ Պահանջվում է արտածել մեկ անգամ հանդիպող տարրը և կարգահամարը հաջորդականությունում։ Խնդիրը լուծելիս օգտագործել զանգված։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    5 1 1 3 4 4

    Ելք
    3 2
    ====== Թեստ #2 =======
    Մուտք
    9 -1 4 5 4 -1 7 6 6 5

    Ելք
    7 5
    ====== Թեստ #3 =======
    Մուտք
    21 1 2 3 4 5 6 7 8 9 10 -100 10 9 8 7 6 5 4 3 2 1

    Ելք
    -100 10
*/

#include <iostream>

int main()
{
    int n;
    int arr[100];
    const int r = 100;
    int j = 0;
    int m = 0;
    int mib;
    std::cin >> n;
    for (int i = 0; i < n; i++)
    {
        std::cin >> arr[i];
    }
    bool f;
    for (int i = 0; i < n; i++)
    {
        f = true;
        for (int c = 0; c < n; c++)
        {
            if ((arr[c] == arr[i]) && (i != c))
            {
                f = false;
                break;
            }
        }
        if (f == true)
        {
            mib = arr[i];
            m = i;
            std::cout << mib << " ";
            std::cout << m << " ";
        }
    }
}
