// Խնդիր 01 Գումար.cpp

/* Գրել ծրագիր, որը մուտքում կստանա 2 ամբողջ թիվ և կարտածի այդ թվերի գումարը */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	1 1

	Ելք
	2

	====== Թեստ #2 =======
	Մուտք
	2 3

	Ելք
	5

	====== Թեստ #3 =======
	Մուտք
	5 5

	Ելք
	10

	====== Թեստ #4 =======
	Մուտք
	-1 -5

	Ելք
	-6

	====== Թեստ #5 =======
	Մուտք
	-123456789 -987654321

	Ելք
	-1111111110

	====== Թեստ #6 =======
	Մուտք
	-40 23

	Ելք
	-17

	====== Թեստ #7 =======
	Մուտք
	159753 258963

	Ելք
	418716

	====== Թեստ #8 =======
	Մուտք
	123456789 123456789

	Ելք
	246913578

	====== Թեստ #9 =======
	Մուտք
	2147483646 1

	Ելք
	2147483647

	====== Թեստ #10 =======
	Մուտք
	-2147483647 -1

	Ելք
	-2147483648
*/

#include <iostream>

int main()
{
   int a, b;
   std::cin >> a >> b;
   std::cout << a + b;
}