// Խնդիր 20 Եռանկյան մակերես.cpp

/* Պահանջվում է գրել ծրագիր, որը մուտքում կստանա եռանկան 3 կողմերը և կարտածի դռա մակերեսը։ Խնդիրը լուծելու համար օգտվել Հերոնի բանաձևից և sqrt() ֆունկցիայից։ */

/*
    Օրինակներ
    ====== Թեստ #1 =======
    Մուտք
    3 4 5

    Ելք
    6
    ====== Թեստ #2 =======
    Մուտք
    4 4 5.65

    Ելք
    7.99998
    ====== Թեստ #3 =======
    Մուտք
    10 10 14

    Ելք
    49.99
    ====== Թեստ #4 =======
    Մուտք
    7 8 9

    Ելք
    26.8328
*/

#include <iostream>
#include <cmath>

double area(double a, double b, double c)
{
    double p, s;
    p = (a + b + c) / 2;
    s = sqrt(p * (p - a) * (p - b) * (p - c));
    return s;
}

int main()
{
    double a, b, c;
    std::cin >> a >> b >> c;
    std::cout << area(a, b, c);
}