// Խնդիր 07 Սահող կետով և ամբողջ թվեր.cpp

/* Գրել ծրագիր, որը մուտքում կստանա 3 ամբողջ թիվ և 1 սահող կետ:  Ծրագիրը որպես արդյունք պետք է արտածի ամբողջ թվերի գումարի և սահող կետով թվի բաժանման արդյունքում ստացված քանորդը։ Հայտնի է, որ սահող կետով թիվը հավասար չէ 0֊ի։ */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	1 2 3 0.5

	Ելք
	12

	====== Թեստ #2 =======
	Մուտք
	1 3 8 2.5

	Ելք
	4.8

	====== Թեստ #3 =======
	Մուտք
	75 12 -80 3.5

	Ելք
	2

	====== Թեստ #4 =======
	Մուտք
	-1 2 1 1.5

	Ելք
	1.33333

	====== Թեստ #5 =======
	Մուտք
	-1 -2 6 -2.5

	Ելք
	-1.2
*/

#include <iostream>

int main()
{
	int a, b, c;
	double d;
	std::cin >> a >> b >> c >> d;
	std::cout << (a + b + c) / d;
}
