// 0.1(work)A-B.cpp

/* Напишите программу, которая будет печатать на экране разность -10 и 26 чисел. */

/*
	Примеры
	====== Тест #1 =======
	Входные данные

	Результат работы
	-36
*/

#include <iostream>
int main()
{
	int x = -10;
	int y = 26;
	int dif = x - y;
	std::cout << dif;
}