// Խնդիր 09 Փոքրատառ և մեծատառ.cpp

/* Գրել ծրագիր, որը մուտքում ստանում է N թիվը [1, 26] միջակայքից և արտածում լատինական այբուբենի N-րդ փոքրատառն ու մեծատառը: */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	1

	Ելք
	a A

	====== Թեստ #2 =======
	Մուտք
	2

	Ելք
	b B

	====== Թեստ #3 =======
	Մուտք
	3

	Ելք
	c C

	====== Թեստ #4 =======
	Մուտք
	10

	Ելք
	j J

	====== Թեստ #5 =======
	Մուտք
	26

	Ելք
	z Z

	====== Թեստ #6 =======
	Մուտք
	24

	Ելք
	x X
*/

#include <iostream>

int main()
{
	unsigned int n;
	std::cin >> n;
	char code = 'a' - 1 + n;
	char symbols = code - ('a' - 'A');
	std::cout << code << " " << symbols;
}