// Խնդիր 05 Սահող կետով թվերի գումար.cpp

/* Պահանջվում է գրել ծրագիր, որը մուտքում կստանա 4 սահող կետով թվեր և կարտածի առաջին երկուսի գումարի և մյուս երկուսի գումարների տարբերությունը։ */

/*
	Օրինակներ
	====== Թեստ #1 =======
	Մուտք
	4.5 3.5 1.75 2.25

	Ելք
	4

	====== Թեստ #2 =======
	Մուտք
	4.5 3.5 -1.75 -2.25

	Ելք
	12

	====== Թեստ #3 =======
	Մուտք
	-159.365 -852.153 458.015 782.126

	Ելք
	-2251.66

	====== Թեստ #4 =======
	Մուտք
	0 0 0 0

	Ելք
	0

	====== Թեստ #5 =======
	Մուտք
	1.99 1.01 1.52 1.48

	Ելք
	0
	Правильный ответ
	0

	====== Թեստ #6 =======
	Մուտք
	0.12345 0.87654 -0.44444 -0.55555

	Ելք
	1.99998
*/

#include <iostream>

int main()
{
	double long a, b, c, d;
	std::cin >> a >> b >> c >> d;
	std::cout << (a + b) - (c + d);
}